Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодействие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодействие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Контактное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтветов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветов</Name>
			<Comment>используется в правах-настройках пользователей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спрашивать</Name>
					<Comment>Будет открыт диалог на выбор варианта: "Да" - выполнить действие "Нет" - отменить действие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
					<Comment>Данное право (настройка) разрешает действие пользователю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
					<Comment>Данное право (настройка) запрещает действие пользователю</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
			<Comment>Виды номенклатуры</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Основной вид ТМЦ, учитываемый на складах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Не хранится на складах, используется для отнесения суммы услуг на себестоимость или доходы и расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
					<Comment>Вид ТМЦ, хранимый на складе и возвращаемый поставщику</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
					<Comment>Вид ТМЦ не хранимый на складе и предназначенный для группового прихода / расхода номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеАктивы</Name>
					<Comment>Прочие активы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
					<Comment>Шины</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диски</Name>
					<Comment>Диски</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерныеАгрегаты</Name>
					<Comment>Номерные агрегаты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛКМ</Name>
					<Comment>Вид ТМЦ, хранимый на складах и комплектуемый из других ТМЦ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опции</Name>
					<Comment>Опции автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автомобили</Name>
					<Comment>Автомобили</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплаты</Name>
			<Comment>Виды оплаты</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаличныйРасчет</Name>
					<Comment>Наличный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Comment>Безналичный расчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяОплата</Name>
					<Comment>Произвольная оплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лизинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскаяКарта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>Договор с комитентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Договор кредита</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
					<Comment>По умолчанию для контрагентов такого вида выбирается именно такой тип договора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
					<Comment>Зарплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатОтветственности</Name>
					<Comment>О материальной ответственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
			<Comment>Типы договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВиртуальныйДоговор</Name>
					<Comment>Виртуальный договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
					<Comment>Договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приложение</Name>
					<Comment>Приложение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Производители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Производители</Name>
			<Comment>Производители</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна производителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Некорректный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулыОбязательны</Name>
					<Comment>Признак обязательности заполнения артикула</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованияУникальны</Name>
					<Comment>Признак уникальности наименований</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Синонимы</Name>
					<Comment>Синонимы производителей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Comment>Синоним производителя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Comment>Синоним является ошибкой</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДонорыАртикулов</Name>
					<Comment>Доноры артикулов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Comment>Производитель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СМ_ABCP/Ext/Module.bsl
//Бондаренко++ 20200122
Процедура ВыгрузитьОптЦеныДляАБСПвПостЗапрос(Параметры = Неопределено)  Экспорт
 
	 Обработки.ВыгрузкаДляАБЦПВэксельPostЗапрос.Создать().ЗаполнитьТаблицуТоваровОтправитьПостЗапрос();	
 	
КонецПроцедуры
//Бондаренко-- 20200122

//Бондаренко++ 20200312
Процедура ЗагрузкаЗаказовИзABCPвФайлФорматаJSON(Параметры = Неопределено)  Экспорт

	//Обработки.ЗагрузкаЗаказовИзABCPвФайлФорматаJSON.Создать().СформироватьЗаказыКлиентовСсайтаАБЦП();
	
	ПутьКфайлу = КаталогВременныхФайлов()+"CustomerOrdersFromABCP.json";	
  	СкладКомпании = Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000359");
 	ДатаНачала = НачалоДня(НачалоДня(ТекущаяДата())-86400); 
 	СерверДляЗапросаABCP = "id23632.public.api.abcp.ru";
	UserLogin = "api@id23632";
	UserPSW = "4ccaad1b07bb89c470bb9afde1001bf2"; 
	DateUpdatedStart1 = Формат(ДатаНачала,"ДФ=yyyy-MM-dd"); //дата-день
 	DateUpdatedStart2 = Формат(ДатаНачала,"ДЛФ=T");         //дата-время
	DateUpdatedStart = DateUpdatedStart1 +" 0"+DateUpdatedStart2;
	ТекстДляЗапросаABCP = "http://"+СерверДляЗапросаABCP+"/cp/orders?userlogin="+UserLogin+"&userpsw="+UserPSW;
 	Соединение = Новый HTTPСоединение(СерверДляЗапросаABCP);     
 	Запрос = Новый HTTPзапрос("/cp/orders?userlogin="+UserLogin+"&userpsw="+UserPSW);
 	Запрос = Новый HTTPзапрос("/cp/orders?userlogin="+UserLogin+"&userpsw="+UserPSW+"&dateUpdatedStart="+DateUpdatedStart);
 	Соединение.Получить(Запрос,ПутьКФайлу);
	
	ИмяФайла = ПутьКФайлу;
	
	НовСтр="";
	
	НомерЗаказаСайта = "";
	
 	ДокОбъект = Документы.ЗаказПокупателя.ПустаяСсылка();
	
	тЧтение = Новый ЧтениеJSON;
 	тЧтение.ОткрытьФайл(ИмяФайла);
	Пока тЧтение.Прочитать() Цикл
  		Если тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.ИмяСвойства Тогда
			Имя  = тЧтение.ТекущееЗначение;
 		КонецЕсли;
		Если тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Булево ИЛИ
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Строка ИЛИ 
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Число ИЛИ 
			тЧтение.ТипТекущегоЗначения = ТипЗначенияJSON.Комментарий Тогда
			ТекущееЗначение = тЧтение.ТекущееЗначение;
 			
			Если Имя = "number" Тогда
				НомерЗаказаСайта = ТекущееЗначение;
			КонецЕсли;	
			
 			Если Имя = "internalNumber" Тогда
				
 				ДокОбъект = НайтиСоздатьЗаказПокупателя(НомерЗаказаСайта);
				
				Если НЕ обЗначениеНеЗаполнено(ДокОбъект) Тогда
					ДокОбъект.ДублиНоменклатурыДопустимы=Истина;
					ДокОбъект.Товары.Очистить();
					Попытка
						ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
 					Исключение
						//					
					КонецПопытки; 
  				КонецЕсли; 
 				
   			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(ДокОбъект) Тогда
  				
 				Если Имя = "userId" Тогда
					НайденныйКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("UIDсайта",СокрЛП(ТекущееЗначение));
					
					//======================================================================================================
					Если НайденныйКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
						//Созданим Контрагента, которого нет
						НайденныйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
						НайденныйКонтрагент.УстановитьНовыйКод();
						НайденныйКонтрагент.Наименование = "Новый контрагент "+СокрЛП(ТекущееЗначение);
						НайденныйКонтрагент.НаименованиеПолное = "Новый контрагент "+СокрЛП(ТекущееЗначение);
						НайденныйКонтрагент.GUIDСайта = СокрЛП(ТекущееЗначение);
						НайденныйКонтрагент.Автор = ПараметрыСеанса.Пользователь;
						НайденныйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель; 
						НайденныйКонтрагент.ВидОтношений = Справочники.ВидыВзаимоотношений.ПустаяСсылка();
						НайденныйКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.Прочее;
						НайденныйКонтрагент.ДатаРождения = НачалоГода(ТекущаяДата());
						НайденныйКонтрагент.ОсновнойТелефон = "+7, 1111111111";
 						НайденныйКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да;
						НайденныйКонтрагент.СогласиеНаОбработкуПерсональныхДанныхДата = ТекущаяДата();
						НайденныйКонтрагент.Комментарий = "Создан автоматически "+Формат(Текущаядата(),"ДЛФ=DDT")+" пользователем "+ПараметрыСеанса.Пользователь;
                        НайденныйКонтрагент.ДатаРегистрации = ТекущаяДата();
 						НайденныйКонтрагент.РекламныйИсточник = Справочники.ИсточникиИнформации.ОбщениеСМОПВИнтернет;
						НайденныйКонтрагент.Родитель=Справочники.Контрагенты.Оптовики;
  						Попытка
							НайденныйКонтрагент.Записать();
						Исключение
							#Если Клиент Тогда 
							Сообщить("ОШИБКА! Не удалось записать нового контрагента с UID сайта: "+СокрЛП(ТекущееЗначение));
							#КонецЕсли
							Продолжить;
						КонецПопытки;
						НайденныйКонтрагент = НайденныйКонтрагент.Ссылка;
					КонецЕсли;					
					//======================================================================================================
					
					Если НЕ обЗначениеНеЗаполнено(НайденныйКонтрагент) Тогда
	 						ДокОбъект.Контрагент = НайденныйКонтрагент; 
							ДокОбъект.Заказчик = НайденныйКонтрагент; 
 							ДокОбъект.ДоговорВзаиморасчетов = НайтиСоздатьДоговор(ДокОбъект.Контрагент,СкладКомпании.Подразделение.Организация,СкладКомпании.Подразделение);
						Иначе
							#Если Клиент Тогда 
							Сообщить("ОШИБКА! Не найден контрагент с "+СокрЛП(ТекущееЗначение),СтатусСообщения.ОченьВажное);
							#КонецЕсли
							Прервать;
						КонецЕсли; 
   				КонецЕсли;
				
				Если Имя = "date" Тогда
 						СтроковаяДата = СтрЗаменить(ТекущееЗначение,"-","");
						СтроковаяДата = СтрЗаменить(СтроковаяДата,":","");
						СтроковаяДата = СтрЗаменить(СтроковаяДата," ","");
						ДокОбъект.Дата = Дата(СтроковаяДата);
						ДокОбъект.Записать();
  				КонецЕсли;
				
				Если Имя = "numberFix" Тогда
					НайтиНоменклатуру = Справочники.Номенклатура.НайтиПоРеквизиту("АртикулАЦ",СокрЛП(ТекущееЗначение));
					//======================================================================================================
 					Если НайтиНоменклатуру=Справочники.Номенклатура.ПустаяСсылка() тогда
 						//Созданим Номенклатуру которой нет
						НайтиНоменклатуру = Справочники.Номенклатура.СоздатьЭлемент();
						НайтиНоменклатуру.УстановитьНовыйКод();
  						НайтиНоменклатуру.Производитель = Справочники.Производители.Неизвестен;
						НайтиНоменклатуру.Родитель = Справочники.Номенклатура.Загруженно;
						НайтиНоменклатуру.Наименование = "Новый товар";
						НайтиНоменклатуру.НаименованиеПолное = "Новый товар";
 						НайтиНоменклатуру.НаименованиеИностранное = "Новый товар";
						НайтиНоменклатуру.Артикул = СокрЛП(ТекущееЗначение);
						НайтиНоменклатуру.АртикулАЦ = СокрЛП(ТекущееЗначение);
						НайтиНоменклатуру.АртикулДляПоиска = СокрЛП(ТекущееЗначение);
						НайтиНоменклатуру.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Штучный;
						НайтиНоменклатуру.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
						НайтиНоменклатуру.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
						НайтиНоменклатуру.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
						НайтиНоменклатуру.ВалютаУчета = Справочники.Валюты.НайтиПоКоду("643");
						Попытка
							НайтиНоменклатуру.Записать();
						Исключение
 							Продолжить;
						КонецПопытки;
 						НайтиНоменклатуру = НайтиНоменклатуру.Ссылка.ПолучитьОбъект();
						НайтиНоменклатуру.ОсновнаяЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("шт");
						Попытка
							НайтиНоменклатуру.Записать();
						Исключение
 							Продолжить;
						КонецПопытки;
						НайтиНоменклатуру = НайтиНоменклатуру.Ссылка;
					КонецЕсли;					
					//======================================================================================================
					Если НЕ обЗначениеНеЗаполнено(НайтиНоменклатуру) Тогда
 						НовСтр.Номенклатура = НайтиНоменклатуру;  
 						НовСтр.Количество = 1;
						НовСтр.ЕдиницаИзмерения = НовСтр.Номенклатура.ОсновнаяЕдиницаИзмерения;
						НовСтр.Коэффициент = НовСтр.ЕдиницаИзмерения.Коэффициент;
	 					НовСтр.Сумма = НовСтр.Цена*НовСтр.Количество*НовСтр.Коэффициент;
						НовСтр.СуммаВсего = НовСтр.Сумма;
						НовСтр.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
						НовСтр.СуммаНДС = НовСтр.СуммаВсего*НовСтр.СтавкаНДС.Ставка/(100+НовСтр.СтавкаНДС.Ставка);
						ДокОбъект.Записать();
					Иначе
						#Если Клиент Тогда 
					    Сообщить("ОШИБКА! Не найдена номенклатура с артикулом "+СокрЛП(ТекущееЗначение),СтатусСообщения.ОченьВажное);
						#КонецЕсли
						Прервать;
 					КонецЕсли; 
  				КонецЕсли;
 				
				Если Имя = "quantityFinal" Тогда
					Попытка
						НовСтр.Количество = Число(СокрЛП(ТекущееЗначение));
						ДокОбъект.Записать();
 					Исключение
						//					
					КонецПопытки; 
       			КонецЕсли;
				
				Если Имя = "priceInSiteCurrency" Тогда
					НовСтр = ДокОбъект.Товары.Добавить();
		 			НовСтр.Цена = Число(СокрЛП(ТекущееЗначение));
 					НовСтр.Сумма = НовСтр.Цена*НовСтр.Количество*НовСтр.Коэффициент;
					НовСтр.СуммаВсего = НовСтр.Сумма;
					НовСтр.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
					НовСтр.СуммаНДС = НовСтр.СуммаВсего*НовСтр.СтавкаНДС.Ставка/(100+НовСтр.СтавкаНДС.Ставка);
   				КонецЕсли;
				
  			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
 	
	тЧтение.Закрыть(); 	   
	
КонецПроцедуры

Функция НайтиСоздатьЗаказПокупателя(Идент) Экспорт
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Комментарий,
		|	ЗаказПокупателя.Ссылка,
		|	ЗаказПокупателя.Дата,
		|	ЗаказПокупателя.ПометкаУдаления,
		|	ЗаказПокупателя.UIDсайта
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказПокупателя.UIDсайта = &Идент";
	
 	Запрос.УстановитьПараметр("Идент",Идент);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		#Если Клиент Тогда 
		Сообщить("Найден документ "+ВыборкаДетальныеЗаписи.Ссылка+" c UIDсайта = "+Идент);
		#КонецЕсли
		Возврат ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	КонецЦикла;
	
	НовДок = Документы.ЗаказПокупателя.СоздатьДокумент();
	
	НовДок.UIDсайта = Идент;
	
	НовДок.Дата = ТекущаяДата();
	НовДок.Автор = ПараметрыСеанса.Пользователь;
	НовДок.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций;
	НовДок.КурсДокумента = 1.0;
	НовДок.КурсВалютыУпр = 1.0;
	НовДок.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	НовДок.ДатаСоздания = ТекущаяДата();
	НовДок.Комментарий = Идент+" , создан обработкой пользователем '"+ПараметрыСеанса.Пользователь+"' "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	НовДок.Контрагент=Справочники.Контрагенты.ОсновнойПокупатель;
	
	НовДок.ДоговорВзаиморасчетов=НайтиСоздатьДоговор(Справочники.Контрагенты.ОсновнойПокупатель,ПараметрыСеанса.ПодразделениеКомпании.Организация,ПараметрыСеанса.ПодразделениеКомпании);
	
	НовДок.ТипЗаказа=Справочники.ТипыЗаказов.КлиентскийЗаказ;
	НовДок.Заказчик=Справочники.Контрагенты.ОсновнойПокупатель;
	НовДок.ТипЦен=Справочники.ТипыЦен.ОптоваяЦена;
	НовДок.ХозОперация=Справочники.ХозОперации.ЗаказПокупателя;
	НовДок.СрокПоставки=ТекущаяДата()+5*24*3600;
	НовДок.ВидОплаты=Перечисления.ВидыОплаты.БезналичныйРасчет;
	НовДок.СкладКомпании=Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000359");
 		
 	НовДок.ПодразделениеКомпании = Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000359").Подразделение;
	НовДок.Организация = Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000359").Подразделение.Организация;
	НовДок.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
 	
	 // Попытка
	 //   НовДок.Записать();
	 //	Сообщить("Записан новый документ "+НовДок);
	 //Исключение
	 //	Сообщить("ОШИБКА! Не удалось записать новый документ ЗаказПокупателя с UIDсайта = "+Идент,СтатусСообщения.ОченьВажное);	
	 //	НовДок = Документы.ЗаказПокупателя.ПустаяСсылка();
	 //КонецПопытки; 
	
	Возврат НовДок;
 
КонецФункции // НайтиСоздатьЗаказПокупателя()

Функция НайтиСоздатьДоговор(ТекКонтрагент,ТекОрганизация,ТекПодразделение) Экспорт
	
	НовДог = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыВзаиморасчетов.Ссылка,
	               |	ДоговорыВзаиморасчетов.Владелец,
	               |	ДоговорыВзаиморасчетов.Организация,
	               |	ДоговорыВзаиморасчетов.ВидДоговора
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.Владелец = &Владелец
	               |	И ДоговорыВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Продажа)
	               |	И ДоговорыВзаиморасчетов.Организация = &Организация
	               |	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ";
	 
	Запрос.УстановитьПараметр("Владелец",ТекКонтрагент);
 	Запрос.УстановитьПараметр("Организация",ТекОрганизация);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	НовДог = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовДог.УстановитьНовыйКод();
	НовДог.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
 	НовДог.ВидДоговора=Перечисления.ВидыДоговоров.Продажа;
	НовДог.Владелец = ТекКонтрагент;
	НовДог.Организация = ТекОрганизация;
	НовДог.Подразделение = ТекПодразделение;
	НовДог.Владелец = ТекКонтрагент;
	НовДог.ДатаНачала = ТекущаяДата();
 	НовДог.Наименование = СокрЛП(НовДог.ВидДоговора)+" от "+Формат(НовДог.ДатаНачала,"ДЛФ=D"); 
	НовДог.Автор = ПараметрыСеанса.Пользователь;
	НовДог.ДатаСоздания = ТекущаяДата();
	НовДог.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	НовДог.Комментарий = "Договор создан обработкой пользователем: "+ПараметрыСеанса.Пользователь+" "+Формат(ТекущаяДата(),"ДЛФ=DDT");
	НовДог.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	Попытка
		НовДог.Записать();
		#Если Клиент Тогда 
		Сообщить("Записан новый договор "+НовДог);
		#КонецЕсли
	Исключение
		#Если Клиент Тогда 
		Сообщить("ОШИБКА! Не удалось записать новый договор ЗаказПокупателя ",СтатусСообщения.ОченьВажное);	
		#КонецЕсли
	  //Форма = НовДог.ПолучитьФорму("ФормаЭлемента");
	  //Если Не Форма.Открыта() Тогда
	  //      Форма.Открыть();
	  //КонецЕсли; 
  	КонецПопытки; 
	
	Возврат НовДог.Ссылка;

КонецФункции // НайтиСоздатьДоговор(Справочники.Контрагенты.ОсновнойПокупатель,ПараметрыСеанса.ПодразделениеКомпании.Организация);()
//Бондаренко-- 20200312
